# jokes.json
[
	"Why do programmers prefer dark mode? Because light attracts bugs.",
	"Why did the programmer quit his job? Because he didn't get arrays.",
	"A SQL query walks into a bar, walks up to two tables and asks: 'Can I join you?'",
	"How many programmers does it take to change a light bulb? None, that's a hardware problem.",
	"There are only 10 kinds of people in this world: those who know binary and those who don’t.",
	"Debugging: Being the detective in a crime movie where you are also the murderer.",
	"Real programmers count from 0.",
	"Why do Java developers wear glasses? Because they don't see sharp.",
	"Programmer: A machine that turns coffee into code.",
	"To understand recursion, you must first understand recursion.",
	"Why do Python programmers prefer snakes? Because they can handle exceptions.",
	"I told my computer I needed a break, and it said: ‘No problem, I’ll go to sleep.’",
	"99 little bugs in the code, 99 little bugs. Take one down, patch it around, 127 little bugs in the code.",
	"Why was the developer unhappy at their job? They wanted arrays.",
	"Computers make very fast, very accurate mistakes.",
	"Why did the functions stop calling each other? Because they had constant arguments.",
	"Why do C programmers have trouble dating? They don’t have class.",
	"What's a programmer's favorite place to hang out? The Foo Bar.",
	"Why do developers hate nature? Too many bugs.",
	"How do you comfort a JavaScript bug? You console it.",
	"Why was the computer cold? It left its Windows open.",
	"A user interface is like a joke. If you have to explain it, it’s not that good.",
	"Why do backend developers never leave their houses? The front-end gives them anxiety.",
	"Why was the developer broke? Because they used up all their cache.",
	"Why do programmers love Linux? Because they can C everything.",
	"I would tell you a UDP joke, but you might not get it.",
	"Why did the Boolean go on a date? To find its true value.",
	"Why did the database administrator leave his wife? She had one-to-many relationships.",
	"Why was the JavaScript developer sad? Because they didn’t know how to ‘null’ their feelings.",
	"Why did the web developer leave the restaurant? They didn’t like the table layout.",
	"Knock, knock. Who’s there? Race condition. Race condition wh— Who’s there?",
	"Why did the programmer drown? He was stuck in the C.",
	"Why do programmers hate weekends? Because there are no commits.",
	"Why did the algorithm go to therapy? It had too many loops.",
	"Why did the AI go to art school? To learn neural drawing.",
	"Why did the Python programmer not respond to texts? He was stuck in an infinite while loop.",
	"Why do coders love Halloween? Because of all the C-spooky elements.",
	"Why was the sysadmin calm? He had everything under control.",
	"Why did the network administrator get promoted? He had strong connections.",
	"Why did the variable leave the function? It needed more scope.",
	"Why was the array so confident? It knew its bounds.",
	"Why was the software developer at the beach? They were debugging the sand.",
	"Why do data scientists love snakes? Because of Python.",
	"Why do programmers hate meetings? Because they prefer async calls.",
	"Why did the Git commit feel lonely? It was detached.",
	"Why did the Java developer wear a sweater? Because it had too many threads.",
	"Why did the C++ developer get fired? He kept throwing exceptions.",
	"Why did the software engineer sleep at work? He didn’t want to lose his state.",
	"Why do programmers hate elevators? They’re always full of bugs and up-down issues.",
	"Why did the laptop go to therapy? It couldn’t process its feelings."
]
